#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

module.cognito.random_password.master_password[0]: Refreshing state... [id=none]
module.cognito.random_password.master_password[1]: Refreshing state... [id=none]
module.eks.data.aws_iam_role.name: Reading...
module.eks.data.aws_vpcs.selected: Reading...
data.aws_iam_role.name: Reading...
module.cognito.aws_secretsmanager_secret.lambda_auth_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:543547057299:secret:lambda-auth-credentials-Z6ONc5]
module.cognito.aws_cognito_user_pool.tech_medicos_clientes_pool: Refreshing state... [id=us-east-1_D51Mrwjg0]
module.dynamoDb.aws_dynamodb_table.medicos: Refreshing state... [id=medicos]
module.dynamoDb.aws_dynamodb_table.pacientes: Refreshing state... [id=pacientes]
module.dynamoDb.aws_dynamodb_table.consultas: Refreshing state... [id=consultas]
module.eks.data.aws_iam_role.name: Read complete after 0s [id=LabRole]
data.aws_iam_role.name: Read complete after 0s [id=LabRole]
module.eks.data.aws_vpcs.selected: Read complete after 0s [id=us-east-1]
module.eks.data.aws_subnets.selected: Reading...
module.cognito.aws_cognito_user.medicos_seed: Refreshing state... [id=us-east-1_D51Mrwjg0/90264SP]
module.cognito.aws_cognito_user.pacientes_seed: Refreshing state... [id=us-east-1_D51Mrwjg0/16756333631]
module.cognito.aws_cognito_user_pool_client.tech_medicos_clientes_pool_client: Refreshing state... [id=63a3u9gojd6un3lk7i7vdpjdh3]
module.eks.data.aws_subnets.selected: Read complete after 1s [id=us-east-1]
module.eks.data.aws_subnet.selected["subnet-0216236b28fe5c298"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0391eec61e5ba1b09"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0119122c14ad32de6"]: Reading...
module.eks.data.aws_subnet.selected["subnet-00c44d7f56fdefc6b"]: Reading...
module.eks.data.aws_subnet.selected["subnet-053ca738b9be281a4"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0c2688939962b1de4"]: Reading...
module.cognito.aws_secretsmanager_secret_version.lambda_auth_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:543547057299:secret:lambda-auth-credentials-Z6ONc5|terraform-20240724012901594400000002]
module.eks.data.aws_subnet.selected["subnet-0391eec61e5ba1b09"]: Read complete after 0s [id=subnet-0391eec61e5ba1b09]
module.eks.data.aws_subnet.selected["subnet-053ca738b9be281a4"]: Read complete after 0s [id=subnet-053ca738b9be281a4]
module.eks.data.aws_subnet.selected["subnet-00c44d7f56fdefc6b"]: Read complete after 0s [id=subnet-00c44d7f56fdefc6b]
module.eks.data.aws_subnet.selected["subnet-0216236b28fe5c298"]: Read complete after 0s [id=subnet-0216236b28fe5c298]
module.eks.data.aws_subnet.selected["subnet-0119122c14ad32de6"]: Read complete after 0s [id=subnet-0119122c14ad32de6]
module.eks.data.aws_subnet.selected["subnet-0c2688939962b1de4"]: Read complete after 0s [id=subnet-0c2688939962b1de4]
module.eks.aws_eks_cluster.eks-techmedicos: Refreshing state... [id=eks-techmedicos]
module.eks.aws_security_group.eks-sg: Refreshing state... [id=sg-05fa8ed4b45092bd7]
module.eks.data.aws_security_group.eks-sg: Reading...
module.eks.aws_eks_node_group.techmedicos-node: Refreshing state... [id=eks-techmedicos:techmedicos-node]
module.eks.data.aws_security_group.eks-sg: Read complete after 0s [id=sg-08c9b2072fbe01e06]
module.eks.aws_eks_addon.aws_ebs_csi_driver: Refreshing state... [id=eks-techmedicos:aws-ebs-csi-driver]
module.eks.aws_eks_addon.vpc_cni: Refreshing state... [id=eks-techmedicos:vpc-cni]
module.eks.aws_eks_addon.core_dns: Refreshing state... [id=eks-techmedicos:coredns]
module.eks.aws_eks_addon.kube_proxy: Refreshing state... [id=eks-techmedicos:kube-proxy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cognito.aws_cognito_user.medicos_seed will be updated in-place
  ~ resource "aws_cognito_user" "medicos_seed" {
        id                 = "us-east-1_D51Mrwjg0/90264SP"
      ~ password           = (sensitive value)
        # (9 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user.pacientes_seed is tainted, so must be replaced
-/+ resource "aws_cognito_user" "pacientes_seed" {
      ~ attributes            = {
          - "sub"            = "3408a408-a0f1-703c-f8e9-34011c779e2c" -> null
            # (3 unchanged elements hidden)
        }
      ~ creation_date         = "2024-07-24T01:29:01Z" -> (known after apply)
      ~ id                    = "us-east-1_D51Mrwjg0/16756333631" -> (known after apply)
      ~ last_modified_date    = "2024-07-24T01:29:01Z" -> (known after apply)
      ~ mfa_setting_list      = [] -> (known after apply)
      ~ password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      ~ status                = "FORCE_CHANGE_PASSWORD" -> (known after apply)
      ~ sub                   = "3408a408-a0f1-703c-f8e9-34011c779e2c" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user_pool_client.tech_medicos_clientes_pool_client will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "tech_medicos_clientes_pool_client" {
        id                                            = "63a3u9gojd6un3lk7i7vdpjdh3"
        name                                          = "pool-client"
        # (16 unchanged attributes hidden)
    }

  # module.cognito.aws_secretsmanager_secret_version.lambda_auth_credentials must be replaced
-/+ resource "aws_secretsmanager_secret_version" "lambda_auth_credentials" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:543547057299:secret:lambda-auth-credentials-Z6ONc5" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:543547057299:secret:lambda-auth-credentials-Z6ONc5|terraform-20240724012901594400000002" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240724012901594400000002" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.cognito.random_password.master_password[0] must be replaced
-/+ resource "random_password" "master_password" {
      ~ bcrypt_hash = (sensitive value)
      ~ id          = "none" -> (known after apply)
      ~ min_lower   = 0 -> 1 # forces replacement
      ~ min_numeric = 0 -> 1 # forces replacement
      ~ min_special = 0 -> 1 # forces replacement
      ~ min_upper   = 0 -> 1 # forces replacement
      ~ result      = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.cognito.random_password.master_password[1] must be replaced
-/+ resource "random_password" "master_password" {
      ~ bcrypt_hash = (sensitive value)
      ~ id          = "none" -> (known after apply)
      ~ min_lower   = 0 -> 1 # forces replacement
      ~ min_numeric = 0 -> 1 # forces replacement
      ~ min_special = 0 -> 1 # forces replacement
      ~ min_upper   = 0 -> 1 # forces replacement
      ~ result      = (sensitive value)
        # (6 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @nsosoares, Action: `pull_request`*